ermacv/open-esp-radio-rs/svd/esp32s31-radio/peripherals/i2c-ana-mst-mem.xml
<?xml version="1.0" encoding="utf-8"?>
<openEspRadioPeripheralFragment id="I2C_ANA_MST_MEM">
    <peripheral>
      <name>PHY_I2C_COMMAND_RAM</name>
      <description>
        SOURCE[ESP_IDF_ESP32S31_MODEM_REG_BASE,BLOB_LIBPHY_PHY_I2C,BLOB_LIBPHY_PHY_DEBUG_I2C];
        CONFIDENCE[instruction-exact]. Official S31
        reg_base.h names this aperture DR_REG_I2C_ANA_MST_MEM_BASE. The
        complete blob establishes its forty-five-entry command layout and the
        population order in phy_i2c_master_cmd_mem_init. Complete
        phy_i2c_check independently names ten logical banks, their block IDs,
        selected host and finite register-index ranges.
      </description>
      <baseAddress>0x2010fc00</baseAddress>
      <registers>
        <register>
          <dim>45</dim><dimIncrement>0x4</dimIncrement><dimIndex>0-44</dimIndex>
          <name>COMMAND_MEMORY%s</name>
          <description>SOURCE[ESP_IDF_ESP32S31_MODEM_REG_BASE,BLOB_LIBPHY_PHY_I2C]; CONFIDENCE[instruction-exact]. One PHY-I2C master command-memory entry; the public header proves the containing memory aperture while the complete blob proves this word layout.</description>
          <addressOffset>0x00</addressOffset><size>32</size><access>write-only</access>
          <fields>
            <field>
              <name>BLOCK</name>
              <description>SOURCE[BLOB_LIBPHY_PHY_DEBUG_I2C]; CONFIDENCE[instruction-exact]. Logical PHY-I2C block ID. The bank host and valid half-open register-index ranges are: SAR1 host 0 [0,7), ULP host 1 [0,11), RFPLL host 1 [0,22), RFPLL_SDM host 1 [0,7), BBPLL host 0 [0,11), BBTOP host 1 [0,57), PERIF host 0 [0,13), BIAS host 1 [0,4), TXRF host 1 [1,22), DIG_REG host 0 [0,15).</description>
              <bitOffset>0</bitOffset><bitWidth>8</bitWidth>
              <writeConstraint><range><minimum>0</minimum><maximum>0xff</maximum></range></writeConstraint>
              <enumeratedValues>
                <enumeratedValue><name>SAR1</name><value>0x10</value></enumeratedValue>
                <enumeratedValue><name>ULP</name><value>0x61</value></enumeratedValue>
                <enumeratedValue><name>RFPLL</name><value>0x62</value></enumeratedValue>
                <enumeratedValue><name>RFPLL_SDM</name><value>0x63</value></enumeratedValue>
                <enumeratedValue><name>BBPLL</name><value>0x66</value></enumeratedValue>
                <enumeratedValue><name>BBTOP</name><value>0x67</value></enumeratedValue>
                <enumeratedValue><name>PERIF</name><value>0x69</value></enumeratedValue>
                <enumeratedValue><name>BIAS</name><value>0x6a</value></enumeratedValue>
                <enumeratedValue><name>TXRF</name><value>0x6b</value></enumeratedValue>
                <enumeratedValue><name>DIG_REG</name><value>0x6d</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field><name>REGISTER</name><bitOffset>8</bitOffset><bitWidth>8</bitWidth><writeConstraint><range><minimum>0</minimum><maximum>0xff</maximum></range></writeConstraint></field>
            <field><name>DATA</name><bitOffset>16</bitOffset><bitWidth>8</bitWidth><writeConstraint><range><minimum>0</minimum><maximum>0xff</maximum></range></writeConstraint></field>
          </fields>
        </register>
      </registers>
    </peripheral>
</openEspRadioPeripheralFragment>
